---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsRoomBoundingWarn
source: html/39ddbeb3-4964-880e-807c-cc2179c54a32.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoofsRoomBoundingWarn Property

The energy analysis model does not contain any roof surfaces! If there are roofs in your model, please verify that they are room bounding, and make sure that the room offsets are high enough to include the roofs.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRoofsRoomBoundingWarn { get; }
```